<?php

    $file = fopen("new.text", "w");
        // fopen() ফাংশন একটি ফাইল ওপেন করে।
        // "new.text" হল ফাইলের নাম। যদি ফাইল না থাকে, তাহলে এটি তৈরি হবে।
        // "w" মানে write mode: ফাইল ওপেন করলে তার পুরোনো সব ডেটা মুছে যাবে এবং নতুন করে লেখা শুরু হবে।

    fwrite($file, "Hello World!");
        //  fwrite() ফাংশন ফাইলের মধ্যে ডেটা লেখার জন্য ব্যবহৃত হয়।
        // এখানে, ফাইলটিতে Hello World! লেখা হবে।

    $file = fopen("new.text", "r");
        // আবার fopen() ব্যবহার করা হয়েছে,
        // তবে এবার "r" মানে read mode – 
        // অর্থাৎ শুধু ফাইল থেকে পড়া যাবে, লেখা যাবে না।
        // আগের ফাইল রিসোর্স $file আবার নতুনভাবে ওপেন করা হয়েছে রিড মোডে।

    echo fread($file, filesize("new.text"));
        //  fread() ফাংশন দিয়ে ফাইল থেকে ডেটা পড়া হয়।
        //  filesize("new.text") ফাইলের সাইজ কত সেটা বের করে,
        //  যাতে পুরো ফাইলটা পড়া যায়।
        // echo দিয়ে সেই পড়া কনটেন্ট প্রিন্ট করা হয়েছে। এখানে প্রিন্ট হবে:
    
    rename("newfile.text", "new.text");
        // rename() ফাংশন দিয়ে ফাইলের নাম পরিবর্তন করা হয়েছে।
        // এখানে "new.text" ফাইলের নাম পরিবর্তন করে "newfile.text" করা হয়েছে।

    mkdir("newfolder");
        // mkdir() ফাংশন দিয়ে একটি নতুন ফোল্ডার তৈরি করা হয়েছে।
        // এখানে "newfolder" নামের একটি ফোল্ডার তৈরি হবে।



?>